# Pandas in Python

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = np.random.randint(1,100,15)
data[3]

74

In [3]:
data

array([65, 75, 87, 74,  7, 72,  6, 17, 74, 24, 13, 35, 44, 99, 40])

In [6]:
s = pd.Series(data)

In [8]:
print(s)

0     65
1     75
2     87
3     74
4      7
5     72
6      6
7     17
8     74
9     24
10    13
11    35
12    44
13    99
14    40
dtype: int32

In [9]:
k = [1,2,3,np.nan,'yolo']
k =pd.Series(k)
k

0       1
1       2
2       3
3     NaN
4    yolo
dtype: object

In [11]:
dates = pd.date_range('20180817',periods=6)
dates

DatetimeIndex(['2018-08-17', '2018-08-18', '2018-08-19', '2018-08-20',
               '2018-08-21', '2018-08-22'],
              dtype='datetime64[ns]', freq='D')

In [13]:
st_name=['one','two','three',np.nan,'four','five']
st_data = pd.Series(st_name)
st_data

0      one
1      two
2    three
3      NaN
4     four
5     five
dtype: object

In [14]:
st_data[2]

'three'

In [15]:
st_data.to_excel('st_data.xls')

In [17]:
import datetime

In [23]:
datetime.datetime(2018,7,21,18,35)

datetime.datetime(2018, 7, 21, 18, 35)

In [20]:
import time

In [21]:
time.ctime()

'Wed Jul 18 17:02:32 2018'

In [22]:
np.random.randn(5,2)

array([[ 2.77507364,  0.27081496],
       [ 0.9445468 , -1.17217163],
       [-1.51187339, -0.42076599],
       [ 1.34807671,  0.89904642],
       [-0.55905815,  0.77393504]])

In [27]:
st_name = ['Akshay','Ishita','Chippi','bagula']
index = ['Name','Maths','Science']
math = [45,90,70,100]
science = [55,101,60,99]

In [28]:
data = [st_name,math,science]
data

[['Akshay', 'Ishita', 'Chippi', 'bagula'],
 [45, 90, 70, 100],
 [55, 101, 60, 99]]

In [31]:
df = pd.DataFrame(data,index=index,columns=np.arange(4))
df

              0       1       2       3
Name     Akshay  Ishita  Chippi  bagula
Maths        45      90      70     100
Science      55     101      60      99

In [36]:
df2 = pd.DataFrame(np.random.randn(6,6),index=dates,columns=list('ABCDEF'))

In [37]:
df2

                   A         B         C         D         E         F
2018-08-17  0.019643  0.606327  0.303530  0.744661 -0.229933  0.091053
2018-08-18 -0.566649  0.935803  1.536169 -0.318892 -0.447618 -1.080215
2018-08-19 -1.390480  1.464945 -0.478330 -0.077930 -4.635353 -0.545506
2018-08-20 -1.319719 -1.358785  1.057126  1.497328 -2.029535 -0.406708
2018-08-21 -0.045333 -0.714359  1.214046 -0.699066 -0.055325  0.796557
2018-08-22 -0.890229 -0.268541 -0.118231 -1.516405  0.024402 -0.179920

In [43]:
df3 = pd.DataFrame({
    'A':[1,2,3],
    'B':pd.Timestamp('20180718'),
    'C':['lol','yolo','GTFO'],
})
df3

   A          B     C
0  1 2018-07-18   lol
1  2 2018-07-18  yolo
2  3 2018-07-18  GTFO

In [57]:
df4 = pd.DataFrame({
    'Username':['Jhon','Harry','Natasha','Kiosh','Root'],
    'Date':pd.date_range('20170818',periods=5),
    'Password':['abcdefg','1234567','two@one@g','redhat','Asimov'],
},index=[1,2,3,4,5])
df4

  Username       Date   Password
1     Jhon 2017-08-18    abcdefg
2    Harry 2017-08-19    1234567
3  Natasha 2017-08-20  two@one@g
4    Kiosh 2017-08-21     redhat
5     Root 2017-08-22     Asimov

In [54]:
Username = ['Jhon','Harry','Natasha','Kiosh','Root']
Date = pd.date_range('20180715',periods=5)
Password = ['abcdefg','1234567','two@one@g','redhat','Asimov']

In [53]:
#declaring Variables beforehand in this method
df5 = pd.DataFrame({
    'Username': Username,
    'Date': Date,
    'Password': Password,
},index=np.arange(1,6))
df5

  Username       Date   Password
1     Jhon 2017-08-18    abcdefg
2    Harry 2017-08-19    1234567
3  Natasha 2017-08-20  two@one@g
4    Kiosh 2017-08-21     redhat
5     Root 2017-08-22     Asimov

In [58]:
df5.head(3)

  Username       Date   Password
1     Jhon 2017-08-18    abcdefg
2    Harry 2017-08-19    1234567
3  Natasha 2017-08-20  two@one@g

In [59]:
df5.tail(3)

  Username       Date   Password
3  Natasha 2017-08-20  two@one@g
4    Kiosh 2017-08-21     redhat
5     Root 2017-08-22     Asimov

In [60]:
df5.index

Int64Index([1, 2, 3, 4, 5], dtype='int64')

In [61]:
df5.columns

Index(['Username', 'Date', 'Password'], dtype='object')

In [62]:
df5.describe()

       Username                 Date Password
count         5                    5        5
unique        5                    5        5
top        Root  2017-08-21 00:00:00  abcdefg
freq          1                    1        1
first       NaN  2017-08-18 00:00:00      NaN
last        NaN  2017-08-22 00:00:00      NaN

In [63]:
df2.describe()

              A         B         C         D         E         F
count  6.000000  6.000000  6.000000  6.000000  6.000000  6.000000
mean  -0.698794  0.110898  0.585718 -0.061717 -1.228894 -0.220790
std    0.610123  1.071854  0.803461  1.064857  1.833102  0.634434
min   -1.390480 -1.358785 -0.478330 -1.516405 -4.635353 -1.080215
25%   -1.212346 -0.602905 -0.012790 -0.604023 -1.634056 -0.510807
50%   -0.728439  0.168893  0.680328 -0.198411 -0.338775 -0.293314
75%   -0.175662  0.853434  1.174816  0.539013 -0.098977  0.023309
max    0.019643  1.464945  1.536169  1.497328  0.024402  0.796557

In [68]:
fd = df.T #to transpose a dataframe
fd

     Name Maths Science
0  Akshay    45      55
1  Ishita    90     101
2  Chippi    70      60
3  bagula   100      99

In [69]:
fd.describe()

          Name  Maths  Science
count        4      4        4
unique       4      4        4
top     Chippi     70       55
freq         1      1        1

In [76]:
fd.sort_values(by='Maths',ascending=False)

     Name Maths Science
3  bagula   100      99
1  Ishita    90     101
2  Chippi    70      60
0  Akshay    45      55

In [79]:
fd.loc[1:4:2,['Maths','Science']]

  Maths Science
1    90     101
3   100      99

In [83]:
fd.iloc[:,1]#for getting a single column

0     45
1     90
2     70
3    100
Name: Maths, dtype: object

In [87]:
fd[fd.Maths>80]

     Name Maths Science
1  Ishita    90     101
3  bagula   100      99

In [1]:
name = ['x','y','z','p','q']
height = [5.5,5.6,5.8,4.11,6.2]
weight = [65,69,75,43,80]
DOB = ['1-1-1986','7-6-1999','10-5-1996','10-10-2002','15-05-1992']

In [6]:
import pandas as pd
import numpy as np
data = pd.DataFrame({
    'Name':name,
    'Height': height,
    'Weight': weight,
},index=np.arange(1,6))

In [7]:
data

  Name  Height  Weight
1    x    5.50      65
2    y    5.60      69
3    z    5.80      75
4    p    4.11      43
5    q    6.20      80

In [12]:
salary = [5000,2000,6000,1000,4000]

In [14]:
#to add a column in dataframe or append a dataframe
data['Salary'] = salary

In [15]:
data

  Name  Height  Weight  Salary
1    x    5.50      65    5000
2    y    5.60      69    2000
3    z    5.80      75    6000
4    p    4.11      43    1000
5    q    6.20      80    4000

In [17]:
data.loc[:,'Height'] = [5.7,5.1,5.10,5.1,6.4]

In [18]:
data

  Name  Height  Weight  Salary
1    x     5.7      65    5000
2    y     5.1      69    2000
3    z     5.1      75    6000
4    p     5.1      43    1000
5    q     6.4      80    4000

In [20]:
data

  Name  Height  Weight  Salary
1    x     5.7      65    5000
2    y     5.1      69    2000
3    z     5.1      75    6000
4    p     5.1      43    1000
5    q     6.4      80    4000

In [22]:
olddata = data.copy()

In [23]:
olddata

  Name  Height  Weight  Salary
1    x     5.7      65    5000
2    y     5.1      69    2000
3    z     5.1      75    6000
4    p     5.1      43    1000
5    q     6.4      80    4000

In [37]:
np.mean(data['Height'])

5.4799999999999995

In [29]:
data.iloc[:,1]=(sum(olddata.iloc[:,1])/5)

In [30]:
data

  Name  Height  Weight  Salary
1    x    5.48      65    5000
2    y    5.48      69    2000
3    z    5.48      75    6000
4    p    5.48      43    1000
5    q    5.48      80    4000

In [39]:
data[data['Weight']<50 ]

  Name  Height  Weight  Salary
4    p    5.48      43    1000

In [54]:
data2 = data.copy()

In [55]:
data2

  Name  Height  Weight  Salary
1    x    5.48      65    5000
2    y    5.48      69    2000
3    z    5.48      75    6000
4    p    5.48      43    1000
5    q    5.48      80    4000

In [66]:
d = data2['Name'].isin(['p'])

In [67]:
data2[d]

  Name  Height  Weight  Salary
4    p    5.48      43    1000

In [68]:
d

1    False
2    False
3    False
4     True
5    False
Name: Name, dtype: bool

In [71]:
data2['Weight'].isin(range(75)) #to check the value within range

1     True
2     True
3    False
4     True
5    False
Name: Weight, dtype: bool

In [84]:
data2[data2['Weight'].isin(range(75))]['Weight'].iloc[:]

1    65
2    69
4    43
Name: Weight, dtype: int64

In [92]:
data2['Weight'][data2['Weight'].isin(range(75))] += 10 # to incremnet of data in range to given value

In [93]:
data2

  Name  Height  Weight  Salary
1    x    5.48      75    5000
2    y    5.48      79    2000
3    z    5.48      75    6000
4    p    5.48      63    1000
5    q    5.48      80    4000

In [94]:
pd.isna(data2)

    Name  Height  Weight  Salary
1  False   False   False   False
2  False   False   False   False
3  False   False   False   False
4  False   False   False   False
5  False   False   False   False

In [96]:
data2.mean()

Height       5.48
Weight      74.40
Salary    3600.00
dtype: float64